openwch/arduino_core_ch32/system/CH32L10x/SRC/Peripheral/src/ch32l103_gpio.c
        /* Clear bit */
        tmp1 = ((GPIO_Remap & REMAP_NUM_MASK) >> 27);

        if(tmp1 == 0)
        {
            tmpreg1 &= ~(1<<0);
            tmpreg2 &= ~(1<<24);
        }
        else if(tmp1 == 1)
        {
            tmpreg1 &= ~(1<<1);
            tmpreg2 &= ~(1<<23);
        }
        else if(tmp1 == 2)
        {
            tmpreg1 &= ~(1<<2);
            tmpreg2 &= ~(3<<19);
        }
        else if(tmp1 == 3)
        {
            tmpreg1 &= ~(1<<3);
            tmpreg2 &= ~(1<<18);
        }
        else if(tmp1 == 4)
        {
            tmpreg1 &= ~(3<<6);
            tmpreg2 &= ~(1<<22);
        }
        else if(tmp1 == 5)
        {
            tmpreg1 &= ~(3<<8);
            tmpreg2 &= ~(1<<21);
        }

        /* Set bit */
        if(NewState != DISABLE)
        {
            tmpreg1 |= (GPIO_Remap & 0x0000FFFF);
            tmpreg2 |= (GPIO_Remap & 0x01FF0000);
        }

        tmpreg1 |= ~DBGAFR_SWJCFG_MASK;

        AFIO->PCFR1 = tmpreg1;
        AFIO->PCFR2 = tmpreg2;
    }
    else if((GPIO_Remap & 0xC0000000) == 0x40000000) /* PCFR2 */
    {
        tmpreg2 = AFIO->PCFR2;

        /* Clear bit */
        tmp1 = ((GPIO_Remap & (~REMAP_MASK)) << 0x10);
        tmpreg2 &= ~tmp1;

        /* Set bit */
        if(NewState != DISABLE)
        {
            tmpreg2 |= tmp1;
        }

        AFIO->PCFR2 = tmpreg2;
    }
    else if((GPIO_Remap & 0xC0000000) == 0x00000000) /* PCFR1 */
    {
        tmpreg1 = AFIO->PCFR1;

        /* Clear bit */
        tmpmask = (GPIO_Remap & DBGAFR_POSITION_MASK) >> 0x10;
        tmp = GPIO_Remap & LSB_MASK;

        if((GPIO_Remap & (DBGAFR_LOCATION_MASK | DBGAFR_NUMBITS_MASK)) == (DBGAFR_LOCATION_MASK | DBGAFR_NUMBITS_MASK)) /* [26:24] 3bit SW_CFG */
        {
            tmpreg1 &= DBGAFR_SWJCFG_MASK;
            AFIO->PCFR1 &= DBGAFR_SWJCFG_MASK;
        }
        else if((GPIO_Remap & DBGAFR_NUMBITS_MASK) == DBGAFR_NUMBITS_MASK) /* [15:0] 2bit */
        {
            tmp1 = ((uint32_t)0x03) << tmpmask;
            tmpreg1 &= ~tmp1;
            tmpreg1 |= ~DBGAFR_SWJCFG_MASK;
        }
        else /* [31:0] 1bit */
        {
            tmpreg1 &= ~(tmp << ((GPIO_Remap >> 0x15) * 0x10));
            tmpreg1 |= ~DBGAFR_SWJCFG_MASK;
        }

        /* Set bit */
        if(NewState != DISABLE)
        {
            tmpreg1 |= (tmp << (((GPIO_Remap & 0x7FFFFFFF )>> 0x15) * 0x10));
        }

        AFIO->PCFR1 = tmpreg1;
    }
}

/*********************************************************************
 * @fn      GPIO_EXTILineConfig
 *
 * @brief   Selects the GPIO pin used as EXTI Line.
 *
 * @param   GPIO_PortSource - selects the GPIO port to be used as source for EXTI lines.
 *            This parameter can be GPIO_PortSourceGPIOx where x can be (A..D).
 *          GPIO_PinSource - specifies the EXTI line to be configured.
 *            This parameter can be GPIO_PinSourcex where x can be (0..15).
 *
 * @return  none
 */
void GPIO_EXTILineConfig(uint8_t GPIO_PortSource, uint8_t GPIO_PinSource)
{
    uint32_t tmp = 0x00;

    tmp = ((uint32_t)0x0F) << (0x04 * (GPIO_PinSource & (uint8_t)0x03));
    AFIO->EXTICR[GPIO_PinSource >> 0x02] &= ~tmp;
    AFIO->EXTICR[GPIO_PinSource >> 0x02] |= (((uint32_t)GPIO_PortSource) << (0x04 * (GPIO_PinSource & (uint8_t)0x03)));
}

/*********************************************************************
 * @fn      GPIO_IPD_Unused
 *
 * @brief   Configure unused GPIO as input pull-down.
 *
 * @param   none
 *
 * @return  none
 */
void GPIO_IPD_Unused(void)
{
    GPIO_InitTypeDef GPIO_InitStructure = {0};
    uint32_t chip = 0;

    OPA_Trim = (((*(uint32_t *)OPA_TRIM_BASE & 0x0000001F) << 25) | (((*(uint32_t *)OPA_TRIM_BASE & 0x00008000)^0x00008000) << 9)) \
            | (((*(uint32_t *)OPA_TRIM_BASE & 0x001F0000) << 1) | (((*(uint32_t *)OPA_TRIM_BASE & 0x80000000)^0x80000000) >> 15));
    ADC_Trim = (*(uint16_t *)ADC_TRIM_BASE);
    TS_Val = (*(uint32_t *)TS_BASE);
    CHIPID = (*(uint32_t *)CHIPID_BASE);
    USBPD_CFG = (*(uint16_t *)USBPD_CFG_BASE);

    RCC_PB2PeriphClockCmd(RCC_PB2Periph_GPIOA | RCC_PB2Periph_GPIOB | RCC_PB2Periph_GPIOC |RCC_PB2Periph_GPIOD |RCC_PB2Periph_AFIO,ENABLE);
    chip =  *( uint32_t * )CHIPID_BASE & (~0x000000F0);
    switch(chip)
    {
        case 0x10320700:     //CH32L103K8U6
        {
            GPIO_InitStructure.GPIO_Pin = GPIO_Pin_10\
                                          |GPIO_Pin_11|GPIO_Pin_12\
                                          |GPIO_Pin_13|GPIO_Pin_14;
            GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
            GPIO_Init(GPIOB, &GPIO_InitStructure);
            GPIO_InitStructure.GPIO_Pin = GPIO_Pin_13;
            GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
            GPIO_Init(GPIOC, &GPIO_InitStructure);
            break;
        }
        case 0x103D0700:     //CH32L103F8U6
        {
            GPIO_PinRemapConfig(GPIO_Remap_PD01, ENABLE);
            GPIO_InitStructure.GPIO_Pin = GPIO_Pin_15;
            GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
            GPIO_Init(GPIOA, &GPIO_InitStructure);
            GPIO_InitStructure.GPIO_Pin = GPIO_Pin_3\
                                          |GPIO_Pin_4|GPIO_Pin_5\
                                          |GPIO_Pin_8|GPIO_Pin_9\
                                          |GPIO_Pin_12;
            GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
            GPIO_Init(GPIOB, &GPIO_InitStructure);
			GPIO_InitStructure.GPIO_Pin = GPIO_Pin_2;
            GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPD;
            GPIO_Init(GPIOB, &GPIO_InitStructure);
            GPIO_InitStructure.GPIO_Pin = GPIO_Pin_13|GPIO_Pin_14\
                                          |GPIO_Pin_15;
            GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
            GPIO_Init(GPIOC, &GPIO_InitStructure);
            GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0|GPIO_Pin_1;
            GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
            GPIO_Init(GPIOD, &GPIO_InitStructure);
            break;
        }
        case 0x103B0700:     //CH32L103G8R6
        {
            GPIO_PinRemapConfig(GPIO_Remap_PD01, ENABLE);
            GPIO_InitStructure.GPIO_Pin = GPIO_Pin_15;
            GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
            GPIO_Init(GPIOA, &GPIO_InitStructure);
            GPIO_InitStructure.GPIO_Pin = GPIO_Pin_4|GPIO_Pin_9;
            GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
            GPIO_Init(GPIOB, &GPIO_InitStructure);
			GPIO_InitStructure.GPIO_Pin = GPIO_Pin_2;
            GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPD;
            GPIO_Init(GPIOB, &GPIO_InitStructure);
            GPIO_InitStructure.GPIO_Pin = GPIO_Pin_13|GPIO_Pin_14\
                                          |GPIO_Pin_15;
            GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
            GPIO_Init(GPIOC, &GPIO_InitStructure);
            GPIO_InitStructure.GPIO_Pin = GPIO_Pin_1;
            GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
            GPIO_Init(GPIOD, &GPIO_InitStructure);
            break;
        }
        case 0x103A0700:     //CH32L103F8P6
        {
            GPIO_InitStructure.GPIO_Pin = GPIO_Pin_8|GPIO_Pin_9\
                                          |GPIO_Pin_10|GPIO_Pin_15;
            GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
            GPIO_Init(GPIOA, &GPIO_InitStructure);
            GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0|GPIO_Pin_3\
                                          |GPIO_Pin_4|GPIO_Pin_5\
										  |GPIO_Pin_9|GPIO_Pin_10\
                                          |GPIO_Pin_11|GPIO_Pin_12\
                                          |GPIO_Pin_13|GPIO_Pin_14\
                                          |GPIO_Pin_15;
            GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
            GPIO_Init(GPIOB, &GPIO_InitStructure);
			GPIO_InitStructure.GPIO_Pin = GPIO_Pin_2;
			GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPD;
			GPIO_Init(GPIOB, &GPIO_InitStructure);			
            GPIO_InitStructure.GPIO_Pin = GPIO_Pin_13|GPIO_Pin_14\
                                          |GPIO_Pin_15;
            GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
            GPIO_Init(GPIOC, &GPIO_InitStructure);
            break;
        }
        case 0x10310700:     //CH32L103C8T6
        {
            break;
        }
        default:
        {
            break;
        }

    }
}
